app/controllers/messages_controller.rb

SELECT "messages".* FROM "messages"  ORDER BY "messages"."created_at" ASC
---
	def index
		# I think this should work the same:
		# @messages = Message.all.order(:created_at).reverse
		@messages = Message.all.order("created_at DESC")

INSERT INTO "messages" ("title", "description", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["title", "NEW Message"], ["description", "Example"], ["user_id", 1], ["created_at", "2016-03-29 19:55:09.569174"], ["updated_at", "2016-03-29 19:55:09.569174"]]
---
	def create
		# I prefer to write the following:
		# @message = Message.create(message_params.merge(user: current_user))
		@message = current_user.messages.build(message_params)
		if @message.save

SELECT  "messages".* FROM "messages" WHERE "messages"."id" = $1 LIMIT 1  [["id", 1]]
---
	def find_message
		@message = Message.find(params[:id])